Data exploration with python's library Pandas?

In [19]:
import pandas as pd

In [20]:
df = pd.read_csv('salaries_by_college_major.csv')

In [21]:
df.shape

(51, 6)

In [22]:
# let's see the names of our columns?
df.columns

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

In [23]:
# let's see whether our data is loaded or not?
df.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business

In [24]:
df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS
50,Source: PayScale Inc.,NaN,NaN,NaN,NaN,NaN

In [25]:
#let's delete the last row that contains NaN?
df.dropna(inplace = True)
df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
45,Political Science,40800.0,78200.0,41200.0,168000.0,HASS
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS

In [26]:
# lets check all the informations about our dataframe?
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 50 entries, 0 to 49
Data columns (total 6 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   Undergraduate Major                50 non-null     object
 1   Starting Median Salary             50 non-null     float64
 2   Mid-Career Median Salary           50 non-null     float64
 3   Mid-Career 10th Percentile Salary  50 non-null     float64
 4   Mid-Career 90th Percentile Salary  50 non-null     float64
 5   Group                              50 non-null     object
dtypes: float64(4), object(2)
memory usage: 2.7+ KB

In [32]:
#Find the College major with highest starting salaries?
print(df['Starting Median Salary'].idxmax())
df['Undergraduate Major'].loc[df['Starting Median Salary'].idxmax()]

43

'Physician Assistant'

In [70]:
#########################@@@@@@@@@@@@@@@@@@@@@@@@@############################@@@@@@@@@@@@@@@@@@@@@@@@@@@@#######################

In [71]:
# what college major has the highest mid-career salary? how much do graduates with this major earn?
print(df['Mid-Career Median Salary'].idxmax())
print(f"The graduate degree with highest mid-career salary is {df['Undergraduate Major'].loc[df['Mid-Career Median Salary'].idxmax()]}.")

8
The graduate degree with highest mid-career salary is Chemical Engineering.

In [72]:
#which college major has the lowest starting salary and how much do graduates earn after university?
print(df['Starting Median Salary'].idxmin())
print(f"The graduate with lowest starting salary is {df['Undergraduate Major'].loc[df['Starting Median Salary'].idxmin()]}.")

49
The graduate with lowest starting salary is Spanish.

In [73]:
#which college major has the lowest mid-career salary and how much can people expect to earn with this degree?
df.loc[df['Starting Median Salary'].idxmin()]

Undergraduate Major                  Spanish
Starting Median Salary               34000.0
Mid-Career Median Salary             53100.0
Mid-Career 10th Percentile Salary    31000.0
Mid-Career 90th Percentile Salary    96400.0
Group                                   HASS
Name: 49, dtype: object

In [74]:
################################################################################################################################

In [83]:
# let's now find the low risk major degree. this is done by subtracting the 90th from 10th percentile.
Spread_col = df['Mid-Career 90th Percentile Salary'].subtract(df['Mid-Career 10th Percentile Salary'])

In [86]:
df.insert(1, 'Spread', Spread_col)
df.head()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,109800.0,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,96700.0,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,113700.0,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,104200.0,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,85400.0,41600.0,76800.0,50600.0,136000.0,Business

In [87]:
# WoW we have inserted our data into the dataframe.

In [101]:
#shorting by the lowest spread.
Low_risk = df.sort_values('Spread')
Low_risk[['Undergraduate Major','Spread']].head()

           Undergraduate Major   Spread
40                     Nursing  50700.0
43         Physician Assistant  57600.0
41                   Nutrition  65300.0
49                     Spanish  65400.0
27  Health Care Administration  66400.0

In [113]:
#let's find the top 5 90th percentile majors
High_values = df.sort_values('Mid-Career 90th Percentile Salary', ascending = False)
High_values[['Undergraduate Major','Mid-Career 90th Percentile Salary']].head()

     Undergraduate Major  Mid-Career 90th Percentile Salary
17             Economics                           210000.0
22               Finance                           195000.0
8   Chemical Engineering                           194000.0
37                  Math                           183000.0
44               Physics                           178000.0

In [114]:
#let's find the majors with greatest spreads in salaries
High_values = df.sort_values('Spread', ascending = False)
High_values[['Undergraduate Major','Spread']].head()

   Undergraduate Major    Spread
17           Economics  159400.0
22             Finance  147800.0
37                Math  137800.0
36           Marketing  132900.0
42          Philosophy  132500.0

In [129]:
#asking pandas to display number format in the output.
pd.options.display.float_format= '{:,.2f}'.format

In [131]:
#Which category of degree has the highest average salary?
df.groupby('Group').mean(1)

,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,
Business,"103,958.33","44,633.33","75,083.33","43,566.67","147,525.00"
HASS,"95,218.18","37,186.36","62,968.18","34,145.45","129,363.64"
STEM,"101,600.00","53,862.50","90,812.50","56,025.00","157,625.00"

In [ ]:
#######################################@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@##############################################

In [ ]:
# Data exploration using pandas project completed and answered the business questions.